import 'package:easy_localization/easy_localization.dart';
import 'package:flutter/material.dart';
import 'package:shanbwrog/ui/general/appbar.dart';

class PrivacyPolicy extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    final devicesize = MediaQuery.of(context).size;
    return SafeArea(
      child: Scaffold(
        body: Padding(
          padding: EdgeInsets.all(20),
          child: SingleChildScrollView(
            child: Column(
              children: [
                NewAppbar(
                  devicesize: devicesize,
                  text: tr('infoaboutus'),
                ),
                SizedBox(
                  height: 50,
                ),
                Text(
                  'هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا النص هو مثال فقد هذا  ',
                  textAlign: TextAlign.center,
                  style: TextStyle(
                      color: Colors.black,
                      fontSize: 17,
                      fontWeight: FontWeight.w500),
                )
              ],
            ),
          ),
        ),
      ),
    );
  }
}
